app/controllers/agents_controller.rb

SELECT `agents`.* FROM `agents` WHERE (status != 6)  ORDER BY created_at desc
---
  def index
    # for demo
    kudu_prepare_table

    @items = Agent.w_not_deleted.order("created_at desc").all